In [3]:
import pandas as pd
import matplotlib as plt

In [14]:
world = pd.read_csv('CSV Files/2018-2019 Happiness.csv')
airbnb = pd.read_csv('CSV Files/airbnb.csv')
salaries = pd.read_csv('CSV Files/salaries.csv')
sales = pd.read_csv('CSV Files/web_sales.csv')

In [16]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60398 entries, 0 to 60397
Data columns (total 11 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductKey             60398 non-null  int64
 1   product                60398 non-null  object
 2   product_subcategory    60398 non-null  object
 3   OrderDateKey           60398 non-null  int64
 4   CalendarYear           60398 non-null  int64
 5   SalesTerritoryRegion   60398 non-null  object
 6   SalesTerritoryCountry  60398 non-null  object
 7   SalesOrderNumber       60398 non-null  object
 8   SalesAmount            60398 non-null  float64
 9   TaxAmt                 60398 non-null  float64
 10  Freight                60398 non-null  float64
dtypes: float64(3), int64(3), object(5)
memory usage: 5.1+ MB

In [4]:
sales.SalesAmount

0        3578.2700
1        3399.9900
2        3399.9900
3         699.0982
4        3399.9900
           ...
60393      21.9800
60394       8.9900
60395      21.9800
60396     159.0000
60397       8.9900
Name: SalesAmount, Length: 60398, dtype: float64

In [5]:
sales['SalesAmount']

0        3578.2700
1        3399.9900
2        3399.9900
3         699.0982
4        3399.9900
           ...
60393      21.9800
60394       8.9900
60395      21.9800
60396     159.0000
60397       8.9900
Name: SalesAmount, Length: 60398, dtype: float64

In [6]:
airbnb.columns

Index(['Host Id', 'Host Since', 'Name', 'Neighbourhood', 'Property Type',
       'Review Scores Rating (bin)', 'Room Type', 'Zipcode', 'Beds',
       'Number of Records', 'Number Of Reviews', 'Price',
       'Review Scores Rating'],
      dtype='object')

In [7]:
airbnb[['Property Type', 'Room Type', 'Beds']]

      Property Type        Room Type  Beds
0         Apartment  Entire home/apt   1.0
1         Apartment     Private room   1.0
2         Apartment     Private room   1.0
3         Apartment  Entire home/apt   3.0
4         Apartment     Private room   3.0
...             ...              ...   ...
30473     Apartment  Entire home/apt   5.0
30474     Apartment     Private room   2.0
30475         Other     Private room   1.0
30476     Apartment     Private room   1.0
30477         House     Private room   1.0

[30478 rows x 3 columns]

In [8]:
salaries.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [9]:
salaries[['experience_level', 'job_title', 'salary_in_usd']]

     experience_level                       job_title  salary_in_usd
0                  EX           Data Science Director         212000
1                  EX           Data Science Director         190000
2                  MI  Business Intelligence Engineer          43064
3                  MI  Business Intelligence Engineer          43064
4                  SE       Machine Learning Engineer         245700
...               ...                             ...            ...
8800               SE                  Data Scientist         412000
8801               MI        Principal Data Scientist         151000
8802               EN                  Data Scientist         105000
8803               EN           Business Data Analyst         100000
8804               SE            Data Science Manager          94665

[8805 rows x 3 columns]

In [10]:
salaries['salary_in_usd'].mean()

149488.26564452017

In [11]:
salaries['salary_in_usd'].max()
salaries['salary_in_usd'].min()
salaries['salary_in_usd'].sum()

1316244179

In [12]:
sales['SalesAmount'].sum()

29358677.220699996

In [13]:
sales.max()

ProductKey                                      606
product                  Women's Mountain Shorts, S
product_subcategory                           Vests
OrderDateKey                               20140128
CalendarYear                                   2014
SalesTerritoryRegion                 United Kingdom
SalesTerritoryCountry                 United States
SalesOrderNumber                            SO75123
SalesAmount                                 3578.27
TaxAmt                                     286.2616
Freight                                     89.4568
dtype: object

In [14]:
salaries.min()

work_year                     2020
experience_level                EN
employment_type                 CT
job_title             AI Architect
salary                       14000
salary_currency                AUD
salary_in_usd                15000
employee_residence              AD
remote_ratio                     0
company_location                AD
company_size                     L
dtype: object

In [15]:
sales.mean(numeric_only = True)

ProductKey      4.375579e+02
OrderDateKey    2.012973e+07
CalendarYear    2.012902e+03
SalesAmount     4.860869e+02
TaxAmt          3.888695e+01
Freight         1.215222e+01
dtype: float64

In [16]:
4.860869e+02

486.0869

In [17]:
sales['SalesAmount'].std()

928.4898919809369

In [18]:
sales['SalesAmount'].mean()

486.0869105053147

In [19]:
airbnb['Beds'].std()

1.0153587174802678

In [20]:
airbnb['Beds'].count()

30393

In [21]:
airbnb.shape

(30478, 13)

In [22]:
airbnb.count()

Host Id                       30478
Host Since                    30475
Name                          30478
Neighbourhood                 30478
Property Type                 30475
Review Scores Rating (bin)    22155
Room Type                     30478
Zipcode                       30344
Beds                          30393
Number of Records             30478
Number Of Reviews             30478
Price                         30478
Review Scores Rating          22155
dtype: int64

In [24]:
sales.describe()

,ProductKey,OrderDateKey,CalendarYear,SalesAmount,TaxAmt,Freight
count,60398.000000,6.039800e+04,60398.000000,60398.000000,60398.000000,60398.000000
mean,437.557932,2.012973e+07,2012.902298,486.086911,38.886954,12.152217
std,118.088390,4.745050e+03,0.477666,928.489892,74.279193,23.212248
min,214.000000,2.010123e+07,2010.000000,2.290000,0.183200,0.057300
25%,359.000000,2.013040e+07,2013.000000,7.950000,0.636000,0.198800
50%,479.000000,2.013071e+07,2013.000000,29.990000,2.399200,0.749800
75%,529.000000,2.013102e+07,2013.000000,539.990000,43.199200,13.499800
max,606.000000,2.014013e+07,2014.000000,3578.270000,286.261600,89.456800

In [25]:
2.012973e+07

20129730.0

In [35]:
airbnb.describe(percentiles= [0.1,0.6, 0.9])

,Host Id,Review Scores Rating (bin),Zipcode,Beds,Number of Records,Number Of Reviews,Review Scores Rating
count,3.047800e+04,22155.000000,30344.000000,30393.000000,30478.0,30478.000000,22155.000000
mean,1.273171e+07,90.738659,10584.854831,1.530089,1.0,12.018735,91.993230
std,1.190270e+07,9.059519,921.299397,1.015359,0.0,21.980703,8.850373
min,5.000000e+02,20.000000,1003.000000,0.000000,1.0,0.000000,20.000000
10%,7.274437e+05,80.000000,10009.000000,1.000000,1.0,0.000000,80.000000
50%,8.551693e+06,90.000000,10065.000000,1.000000,1.0,3.000000,94.000000
60%,1.216061e+07,95.000000,11205.000000,1.000000,1.0,6.000000,96.000000
90%,3.243044e+07,100.000000,11237.000000,3.000000,1.0,35.000000,100.000000
max,4.303307e+07,100.000000,99135.000000,16.000000,1.0,257.000000,100.000000

In [32]:
sales.describe(include='object')

,product,product_subcategory,SalesTerritoryRegion,SalesTerritoryCountry,SalesOrderNumber
count,60398,60398,60398,60398,60398
unique,130,17,10,6,27659
top,Water Bottle - 30 oz.,Tires and Tubes,Australia,United States,SO70714
freq,4244,17332,13345,21344,8

In [49]:
sales[['SalesTerritoryCountry', 'product_subcategory']].value_counts()

SalesTerritoryCountry  product_subcategory
United States          Tires and Tubes        6062
Australia              Tires and Tubes        3300
United States          Bottles and Cages      2951
Canada                 Tires and Tubes        2729
Australia              Road Bikes             2603
                                              ...
France                 Bike Racks               25
Germany                Bike Racks               24
                       Bike Stands              20
France                 Bike Stands              19
Germany                Shorts                    9
Name: count, Length: 102, dtype: int64

In [46]:
airbnb[['Neighbourhood', 'Property Type']].value_counts()

Neighbourhood  Property Type
Manhattan      Apartment          15433
Brooklyn       Apartment           9740
Queens         Apartment           1659
Brooklyn       House               1202
Queens         House                522
Brooklyn       Loft                 502
Manhattan      Loft                 227
Bronx          Apartment            218
Manhattan      House                168
Bronx          House                110
Staten Island  House                 88
Brooklyn       Townhouse             79
               Bed & Breakfast       76
Manhattan      Bed & Breakfast       60
               Condominium           56
Staten Island  Apartment             52
Manhattan      Townhouse             45
Queens         Bed & Breakfast       36
Brooklyn       Condominium           30
Manhattan      Other                 23
Brooklyn       Dorm                  19
Queens         Loft                  17
Brooklyn       Other                 16
Queens         Townhouse              8
               Dorm                   6
               Other                  6
Bronx          Bed & Breakfast        6
Manhattan      Dorm                   6
Bronx          Loft                   6
Queens         Camper/RV              5
               Boat                   5
               Condominium            5
               Villa                  4
Bronx          Condominium            3
Manhattan      Villa                  3
Brooklyn       Tent                   3
Queens         Bungalow               3
Staten Island  Other                  2
               Bed & Breakfast        2
Bronx          Townhouse              2
Staten Island  Townhouse              2
Brooklyn       Treehouse              2
Manhattan      Treehouse              2
               Boat                   2
Brooklyn       Lighthouse             1
Manhattan      Cabin                  1
Staten Island  Loft                   1
Manhattan      Hut                    1
Brooklyn       Villa                  1
Manhattan      Tent                   1
Brooklyn       Boat                   1
Queens         Cabin                  1
Brooklyn       Bungalow               1
Queens         Hut                    1
Brooklyn       Camper/RV              1
               Chalet                 1
Manhattan      Camper/RV              1
               Castle                 1
Name: count, dtype: int64

In [45]:
airbnb.columns

Index(['Host Id', 'Host Since', 'Name', 'Neighbourhood', 'Property Type',
       'Review Scores Rating (bin)', 'Room Type', 'Zipcode', 'Beds',
       'Number of Records', 'Number Of Reviews', 'Price',
       'Review Scores Rating'],
      dtype='object')

In [59]:
salaries[['job_title', 'salary_in_usd', 'experience_level']].value_counts()

job_title                        salary_in_usd  experience_level
Data Engineer                    160000         SE                  51
Applied Scientist                136000         SE                  48
Data Scientist                   160000         SE                  44
Data Engineer                    130000         SE                  44
Data Scientist                   140000         SE                  38
                                                                    ..
Data Engineer                    143865         MI                   1
                                 144100         SE                   1
                                 144200         MI                   1
                                 146000         EX                   1
Staff Machine Learning Engineer  185000         SE                   1
Name: count, Length: 4107, dtype: int64

In [52]:
salaries.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')